In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

data = pd.read_csv(r'C:\Users\Kerry\clean_jobs.csv')
print(data.shape)
data.head()

(327, 10)

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
0,1,Data Analyst,Meta,"New York, NY",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
1,2,Data Analyst,Meta,"San Francisco, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
2,3,Data Analyst,Meta,"Los Angeles, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
3,4,Data Analyst,Meta,"Washington, DC",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
4,5,Data Analyst II,Pinterest,"Chicago, IL",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-16,NaN,NaN,About Pinterest\n\nMillions of people around t...

In [2]:
data.isnull().sum()

id                   0
title                0
company              0
location             0
link                 0
source               0
date_posted          0
work_type          327
employment_type    327
description          0
dtype: int64

In [3]:
data.duplicated().sum()

0

In [8]:
data = data.drop(columns=['work_type', 'employment_type'])

In [9]:
data.columns

Index(['id', 'title', 'company', 'location', 'link', 'source', 'date_posted',
       'description'],
      dtype='object')

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           0 non-null      int64
 1   title        0 non-null      object
 2   company      0 non-null      object
 3   location     0 non-null      object
 4   link         0 non-null      object
 5   source       0 non-null      object
 6   date_posted  0 non-null      object
 7   description  0 non-null      object
dtypes: int64(1), object(7)
memory usage: 0.0+ bytes

In [7]:
data.describe()

        id  work_type  employment_type
count  0.0        0.0              0.0
mean   NaN        NaN              NaN
std    NaN        NaN              NaN
min    NaN        NaN              NaN
25%    NaN        NaN              NaN
50%    NaN        NaN              NaN
75%    NaN        NaN              NaN
max    NaN        NaN              NaN